app/controllers/admin/articles_controller.rb

SELECT  `articles`.* FROM `articles`  ORDER BY `articles`.`id` DESC LIMIT 10 OFFSET 50
SELECT COUNT(*) FROM `articles`
---
    def index
      @articles = Article.all.page(params[:page]).per(10)

INSERT INTO `articles` (`title`, `content`, `created_at`, `updated_at`) VALUES ('asdada', 'asdad', '2016-07-25 16:32:27', '2016-07-25 16:32:27')
---
    def create
      @article = Article.new(article_param)
      if @article.save

UPDATE `articles` SET `content` = 'asdadsadadada11', `updated_at` = '2016-07-25 16:32:19' WHERE `articles`.`id` = 8
---
    def update
      if @article.update(article_param)

DELETE FROM `articles` WHERE `articles`.`id` = 7
---
    def destroy
      if @article.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 8 LIMIT 1
---
    def find_article
      @article = Article.find(params[:id])